# CreatePartsWithInvalidSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..CreatePartsWithInvalidSystem Property
BuiltInFailures..::..SystemsFailures Class See Also
---
Parts were not created because the element does not have a valid system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreatePartsWithInvalidSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreatePartsWithInvalidSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreatePartsWithInvalidSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace